{
   "intents": [
     {
       "tag": "welcome",
       "patterns": [
         "Hello",
         "Hi there",
         "Hi",
         "Hey",
         "Is someone there",
         "Good day"
       ],
       "responses": [
         "Hello! How can I assist you today?",
         "Hi there, I'm here to help. What do you need assistance with?",
         "Greetings! How can I support you today?"
       ],
       "context_set": ""
     },
     {
       "tag": "accessibility_services",
       "patterns": [
         "Can you tell me about the accessibility services",
         "What kind of support is available for blind people",
         "Do you offer any special services for visually impaired",
         "How can I access the services for blind",
         "Information about assistance for blind"
       ],
       "responses": [
         "We offer a range of accessibility services for visually impaired individuals, including text-to-speech services, guided assistance, and braille materials.",
         "Our accessibility services include braille documentation, navigation assistance, and dedicated support personnel."
       ],
       "context_set": ""
     },
     {
       "tag": "navigation_assistance",
       "patterns": [
         "I need help with navigation",
         "Can you guide me through the building",
         "How do I get to the library",
         "Assist me with finding the main office",
         "Need help moving around"
       ],
       "responses": [
         "Sure, I can help you navigate. Where would you like to go?",
         "I can provide you with detailed directions. Which area are you trying to reach?"
       ],
       "context_set": ""
     },
     {
       "tag": "reading_materials",
       "patterns": [
         "Do you have books in braille",
         "I need audiobooks",
         "Where can I find reading materials for the visually impaired",
         "Can I get texts in audio format",
         "Access to braille books"
       ],
       "responses": [
         "Yes, we have a collection of braille books and audiobooks. Let me guide you to them.",
         "Our library offers a variety of reading materials in braille and audio formats for your convenience."
       ],
       "context_set": ""
     },
     {
      "tag": "technology_support",
      "patterns": [
        "What kind of tech support do you offer",
        "Help with assistive technologies",
        "Information on technology for blind",
        "Can you recommend any apps for visually impaired",
        "Tech assistance for blind"
      ],
      "responses": [
        "We provide support for a range of assistive technologies such as screen readers, magnification software, and accessible apps designed for visually impaired users.",
        "Our tech support includes assistance with setting up and using accessible technologies and applications tailored for blind individuals."
      ],
      "context_set": ""
    },
    {
      "tag": "emergency_assistance",
      "patterns": [
        "I need immediate help",
        "What should I do in case of an emergency",
        "How to get urgent assistance",
        "Emergency services for blind",
        "Contact for emergencies"
      ],
      "responses": [
        "In case of an emergency, you can reach out to our 24/7 support line at [emergency contact number].",
        "For immediate assistance, please use our emergency hotline available on our app or dial [emergency contact number]."
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "See you later",
        "I have to go now",
        "Thank you for your help"
      ],
      "responses": [
        "Goodbye! Don't hesitate to return if you need more assistance.",
        "It was my pleasure to help. Have a great day!"
      ],
      "context_set": ""
    },
    {
      "tag": "task",
      "patterns": [
        "what can you do",
        "what are the thing you can do",
        "things you can do",
        "what can u do for me",
        "how u can help me",
        "why i should use you"
      ],
      "responses": [
        "I can answer to low-intermediate questions regarding college",
        "You can ask me questions regarding college, and i will try to answer them"
      ],
      "context_set": ""
    },

    {
      "tag": "course_information",
      "patterns": [
        "Tell me about the courses available",
        "What courses do you offer for blind students",
        "Course details for visually impaired",
        "Available courses for the upcoming semester",
        "List of accessible courses"
      ],
      "responses": [
        "We offer a variety of courses that are fully accessible to blind and visually impaired students, including adapted materials and support.",
        "Our course offerings include accessible technology training, braille literacy, and other subjects with full support for visually impaired students."
      ],
      "context_set": ""
    },
    {
      "tag": "registration_process",
      "patterns": [
        "How do I register for courses",
        "Registration process for blind students",
        "Can you guide me through the registration",
        "Steps for course registration",
        "Enrollment procedure for visually impaired"
      ],
      "responses": [
        "The registration process includes support for visually impaired students. We can guide you through each step either via phone or in-person assistance.",
        "To register for courses, please contact our accessibility office, and they will assist you with the process ensuring all materials are accessible."
      ],
      "context_set": ""
    },
    {
      "tag": "facility_access",
      "patterns": [
        "How accessible are your facilities",
        "Information on facility access for blind",
        "Are all buildings equipped for the visually impaired",
        "Campus accessibility features",
        "Do you have braille signs around the campus"
      ],
      "responses": [
        "Our campus is equipped with features to assist the visually impaired, including braille signs, accessible pathways, and support personnel.",
        "We ensure that all facilities are accessible to blind students, with tactile guides, auditory signals, and personal assistance available."
      ],
      "context_set": ""
    },
    {
      "tag": "support_services",
      "patterns": [
        "What support services do you offer",
        "Assistance for visually impaired students",
        "Support services for blind students on campus",
        "How can I access student support services",
        "Services available for students with visual impairment"
      ],
      "responses": [
        "We provide a comprehensive range of support services for visually impaired students, including tutoring, mobility training, and tech assistance.",
        "Our support services are designed to ensure that visually impaired students have equal access to educational and campus resources."
      ],
      "context_set": ""
    },
    {
      "tag": "community_engagement",
      "patterns": [
        "Are there any groups for blind students to join",
        "Community engagement opportunities",
        "Clubs for visually impaired students",
        "How can I get involved in the community",
        "Student groups that welcome visually impaired"
      ],
      "responses": [
        "We have several community engagement opportunities and clubs specifically for visually impaired students to help you get involved and meet peers.",
        "Our student groups and community engagement programs are inclusive, offering various activities accessible to blind students."
      ],
      "context_set": ""
    },
    {
      "tag": "personal_assistance",
      "patterns": [
        "Can I get a personal assistant for navigating campus",
        "Assistance with daily activities on campus",
        "Is personal assistance available for blind students",
        "Help with accessing campus resources",
        "Support for day-to-day tasks for visually impaired"
      ],
      "responses": [
        "Personal assistance is available for visually impaired students for navigating campus and accessing resources. Contact our accessibility office for more details.",
        "We provide support through personal assistants to help visually impaired students with daily activities and ensure full access to campus resources."
      ],
      "context_set": ""
    },
    {
      "tag": "adaptive_technology",
      "patterns": [
        "What adaptive technology is available on campus",
        "Technology support for blind students",
        "Resources for adaptive technology",
        "Adaptive devices for coursework",
        "Technology assistance for visually impaired"
      ],
      "responses": [
        "Our campus offers a range of adaptive technology for blind students, including screen readers, braille displays, and accessible software.",
        "We provide comprehensive technology support and resources, ensuring that visually impaired students have the tools needed for academic success."
      ],
      "context_set": ""
    },
    {
      "tag": "feedback",
      "patterns": [
        "How can I provide feedback about accessibility",
        "Reporting issues with campus accessibility",
        "Suggestions for improving services for blind students",
        "Feedback on support services",
        "Where to give feedback about accessibility resources"
      ],
      "responses": [
        "Your feedback is crucial in improving our accessibility services. Please contact our accessibility office or use our online feedback form.",
        "We welcome feedback and suggestions on how to improve our services and resources for visually impaired students."
      ],
      "context_set": ""
    },

    {
      "tag": "emergency_procedures",
      "patterns": [
        "What should I do in case of an emergency on campus?",
        "Explain the emergency evacuation process for blind students.",
        "How will I be alerted in an emergency situation?",
        "Emergency procedures for visually impaired students."
      ],
      "responses": [
        "In an emergency, audible alarms and campus staff will guide you to safety. We also have specific procedures in place for visually impaired students.",
        "Our emergency procedures include direct assistance for visually impaired students. Make sure to register with the accessibility office to receive personalized alerts."
      ],
      "context_set": ""
    },
    {
      "tag": "digital_resources_navigation",
      "patterns": [
        "How can I access digital resources?",
        "Navigating the school's website as a blind student.",
        "Are online portals accessible for visually impaired?",
        "Help with using digital libraries and resources."
      ],
      "responses": [
        "Our digital resources are fully accessible, with screen reader compatibility and support staff available to assist with navigation.",
        "We ensure that all digital resources, including our website and online portals, are accessible to visually impaired students. For assistance, contact the tech support team."
      ],
      "context_set": ""
    },
    {
      "tag": "social_events",
      "patterns": [
        "Are there social events for blind students?",
        "How can I find out about upcoming social activities?",
        "Social gatherings suitable for visually impaired students.",
        "Inclusive events for students with disabilities."
      ],
      "responses": [
        "We host a variety of social events that are accessible and inclusive for blind students. Check our events calendar or contact student services for more information.",
        "Our campus prides itself on inclusive social events with accommodations for visually impaired students. Stay updated through our newsletter or student services."
      ],
      "context_set": ""
    },
    {
      "tag": "health_services",
      "patterns": [
        "What health services are available for blind students?",
        "Accessing health care on campus for visually impaired.",
        "Is there a medical professional familiar with blindness?",
        "Health and wellness support for students with visual impairments."
      ],
      "responses": [
        "Our health center provides services tailored to blind students, with staff trained in visual impairment health care needs.",
        "We offer health services with accessibility in mind, including specialized support for visually impaired students. For more details, visit the health center or our website."
      ],
      "context_set": ""
    },

    {
      "tag": "vocational_training",
      "patterns": [
        "Are there any vocational training programs for blind people?",
        "Vocational opportunities for visually impaired",
        "Work training programs accessible to blind students",
        "Career training for the visually impaired"
      ],
      "responses": [
        "Yes, we offer vocational training programs specifically designed for visually impaired individuals to help prepare for various careers.",
        "Our vocational training includes accessible workshops and career counseling services tailored for blind and visually impaired students."
      ],
      "context_set": ""
    },
    {
      "tag": "transportation_services",
      "patterns": [
        "What transportation services are available for blind students?",
        "Is there a shuttle service for visually impaired?",
        "Campus transportation that's accessible to the blind",
        "How do blind students navigate the campus transportation system?"
      ],
      "responses": [
        "We provide specialized transportation services for blind students, including accessible shuttles and guided assistance upon request.",
        "Our campus transportation system is equipped to assist visually impaired students, with features designed to ensure safe and convenient travel."
      ],
      "context_set": ""
    },
    {
      "tag": "legal_assistance",
      "patterns": [
        "Is there legal assistance available for blind individuals?",
        "Legal rights support for visually impaired students",
        "Accessing legal help as a blind person",
        "Legal services for students with visual impairments"
      ],
      "responses": [
        "Legal assistance for blind individuals is available through our accessibility office, offering support with understanding rights and navigating legal issues.",
        "We provide legal support services tailored for visually impaired students, ensuring access to legal advice and representation when needed."
      ],
      "context_set": ""
    },
    {
      "tag": "adaptive_sports",
      "patterns": [
        "What adaptive sports programs are available for blind students?",
        "Sports activities for the visually impaired",
        "Participating in sports as a blind student",
        "Adaptive athletics for students with visual impairments"
      ],
      "responses": [
        "Our adaptive sports programs for blind students include goalball, swimming, judo, and more, designed to promote physical fitness and teamwork.",
        "We offer a range of sports activities accessible to visually impaired students, encouraging participation in adaptive athletics for all skill levels."
      ],
      "context_set": ""
    },

    {
      "tag": "account_help",
      "patterns": [
        "How do I create an account?",
        "I'm having trouble logging in",
        "Can you help me reset my password?",
        "What do I do if I forgot my username?",
        "Account creation process"
      ],
      "responses": [
        "To create an account, please visit our sign-up page. For password resets, follow the 'forgot password' link on the login page or contact support for more help.",
        "If you've forgotten your username, you can usually use your email address to log in instead. For further assistance, please reach out to our customer support team."
      ],
      "context_set": ""
    },
    {
      "tag": "order_status",
      "patterns": [
        "Can you check the status of my order?",
        "How do I track my order?",
        "I haven't received my order yet",
        "When will my order arrive?",
        "Tracking an order"
      ],
      "responses": [
        "To check the status of your order, please enter your order ID on our tracking page or contact our customer service for detailed information.",
        "If you're having trouble tracking your order, ensure you've received a confirmation email with your order number. If your order seems delayed, please contact customer support."
      ],
      "context_set": ""
    },
    {
      "tag": "product_information",
      "patterns": [
        "Can you tell me more about Product X?",
        "I need specifications for Product Y",
        "What colors does this product come in?",
        "Do you have information on this service?",
        "Product details and specifications"
      ],
      "responses": [
        "Certainly! What specific details are you looking for about Product X? For a full list of specifications and available colors, you can visit the product page on our website.",
        "We have a wide range of information available for all our products and services. If you have a specific question, I'm here to help!"
      ],
      "context_set": ""
    },
    {
      "tag": "feedback_and_complaints",
      "patterns": [
        "I would like to make a complaint",
        "Where can I leave feedback?",
        "How do I report an issue with your service?",
        "I'm not happy with my purchase",
        "Submitting feedback or complaints"
      ],
      "responses": [
        "We're sorry to hear you're not satisfied. To make a complaint or leave feedback, you can fill out our feedback form on the website or directly contact customer service.",
        "Your feedback is important to us. Please let us know more about your experience, and we'll do our best to address the issue."
      ],
      "context_set": ""
    },
    {
      "tag": "technical_support",
      "patterns": [
        "I'm experiencing a technical issue",
        "Can you help me install this software?",
        "Why isn't the app working on my phone?",
        "Trouble with website loading",
        "Technical help and troubleshooting"
      ],
      "responses": [
        "I'd be happy to help with technical issues. Can you provide more details on the problem you're facing?",
        "For software installation and app issues, please ensure your device meets the minimum requirements and check our FAQ for troubleshooting tips."
      ],
      "context_set": ""
    },

    {
      "tag": "services_offered",
      "patterns": [
        "What services do you provide?",
        "List of services offered",
        "Can you give me a rundown of your services?",
        "Services available from your organization"
      ],
      "responses": [
        "We offer a wide range of services including customer support, technical assistance, and product information. How can I assist you further?",
        "Our services are designed to meet all your needs, from technical support to general inquiries. Let me know what specific service you're interested in!"
      ],
      "context_set": ""
    },
    {
      "tag": "scheduling_appointments",
      "patterns": [
        "How do I schedule an appointment?",
        "I need to book a time slot",
        "Appointment booking process",
        "Can I get an appointment for next week?"
      ],
      "responses": [
        "Scheduling an appointment is easy! You can book directly through our website or let me know the details, and I can assist you.",
        "To book an appointment, please provide the desired date and time, and I'll check our availability for you."
      ],
      "context_set": ""
    },
    {
      "tag": "general_inquiries",
      "patterns": [
        "Who can I talk to for more information?",
        "I have some questions, who do I ask?",
        "Need more details, who should I contact?",
        "Looking for more information"
      ],
      "responses": [
        "I'm here to help answer any questions you might have. Feel free to ask me anything.",
        "For more detailed information, you can contact our customer service team directly, or I can try to provide the answers you're looking for."
      ],
      "context_set": ""
    },
    {
      "tag": "user_feedback",
      "patterns": [
        "I want to leave feedback, how can I do that?",
        "Where can I submit my feedback?",
        "I have some comments about your service",
        "Feedback submission process"
      ],
      "responses": [
        "We'd love to hear from you! Feedback can be submitted through our website's feedback form or directly via email at feedback@example.com.",
        "Your feedback is important to us. Please use the feedback form on our website to share your thoughts and suggestions."
      ],
      "context_set": ""
    },
    {
      "tag": "miscellaneous",
      "patterns": [
        "Tell me a joke",
        "Do you have any easter eggs?",
        "What's the secret feature?",
        "Any hidden functionalities I should know about?"
      ],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "Our system is full of surprises. Have you tried asking for a magic trick?",
        "I could tell you, but then it wouldn't be a secret anymore. Explore our services, and who knows what you'll find!"
      ],
      "context_set": ""
    },
    {
      "tag": "services_offered",
      "patterns": [
        "What services do you provide?",
        "List of services offered",
        "Can you give me a rundown of your services?",
        "Services available from your organization"
      ],
      "responses": [
        "We offer a wide range of services including customer support, technical assistance, and product information. How can I assist you further?",
        "Our services are designed to meet all your needs, from technical support to general inquiries. Let me know what specific service you're interested in!"
      ],
      "context_set": ""
    },
    {
      "tag": "scheduling_appointments",
      "patterns": [
        "How do I schedule an appointment?",
        "I need to book a time slot",
        "Appointment booking process",
        "Can I get an appointment for next week?"
      ],
      "responses": [
        "Scheduling an appointment is easy! You can book directly through our website or let me know the details, and I can assist you.",
        "To book an appointment, please provide the desired date and time, and I'll check our availability for you."
      ],
      "context_set": ""
    },
    {
      "tag": "general_inquiries",
      "patterns": [
        "Who can I talk to for more information?",
        "I have some questions, who do I ask?",
        "Need more details, who should I contact?",
        "Looking for more information"
      ],
      "responses": [
        "I'm here to help answer any questions you might have. Feel free to ask me anything.",
        "For more detailed information, you can contact our customer service team directly, or I can try to provide the answers you're looking for."
      ],
      "context_set": ""
    },
    {
      "tag": "user_feedback",
      "patterns": [
        "I want to leave feedback, how can I do that?",
        "Where can I submit my feedback?",
        "I have some comments about your service",
        "Feedback submission process"
      ],
      "responses": [
        "We'd love to hear from you! Feedback can be submitted through our website's feedback form or directly via email at feedback@example.com.",
        "Your feedback is important to us. Please use the feedback form on our website to share your thoughts and suggestions."
      ],
      "context_set": ""
    },
    {
      "tag": "miscellaneous",
      "patterns": [
        "Tell me a joke",
        "Do you have any easter eggs?",
        "What's the secret feature?",
        "Any hidden functionalities I should know about?"
      ],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "Our system is full of surprises. Have you tried asking for a magic trick?",
        "I could tell you, but then it wouldn't be a secret anymore. Explore our services, and who knows what you'll find!"
      ],
      "context_set": ""
    },
    {
      "tag": "find_school",
      "patterns": [
        "Where is the nearest school?",
        "I'm looking for a school in my area",
        "Directions to the local school",
        "Can you help me find a school?"
      ],
      "responses": [
        "To find the nearest school, please provide me with your current location or the area you're interested in.",
        "You can find schools in your area by visiting our online directory [Link to school directory]."
      ],
      "context_set": ""
    },
    {
      "tag": "find_market",
      "patterns": [
        "Where's the closest market?",
        "I need to find a market nearby",
        "Location of the nearest market, please",
        "How do I get to the local market?"
      ],
      "responses": [
        "The closest market to you can be found by checking our market locator tool [Link to market locator].",
        "Please provide me with your current location to help you find the nearest market."
      ],
      "context_set": ""
    },
    {
      "tag": "find_store",
      "patterns": [
        "I'm looking for a specific store",
        "Where can I find an electronics store?",
        "Need to find a clothing store near me",
        "Directions to the nearest store"
      ],
      "responses": [
        "Which type of store are you looking for? I can help you find electronics, clothing, and more.",
        "You can use our store finder feature [Link to store finder] or provide your current location for specific recommendations."
      ],
      "context_set": ""
    },
    {
      "tag": "find_hospital",
      "patterns": [
        "I need the location of the nearest hospital",
        "How to get to the closest hospital?",
        "Find a hospital near me",
        "Emergency hospital locations"
      ],
      "responses": [
        "It's important to get to the nearest hospital quickly in an emergency. Please provide your location for detailed directions.",
        "You can find the nearest hospital by using our health services map [Link to health services map]."
      ],
      "context_set": ""
    },
    {
      "tag": "general_location_query",
      "patterns": [
        "How do I find a place in my city?",
        "I'm looking for directions",
        "Can you show me on the map where it is?",
        "Help me find a specific location"
      ],
      "responses": [
        "Sure, I can help with that. What place are you looking for?",
        "To assist you better, please provide me with the name of the place or its type, and your current location."
      ],
      "context_set": ""
    },

    {
      "tag": "find_park",
      "patterns": [
        "Where's the nearest park?",
        "I want to go to a nearby park",
        "Can you find a park for me?",
        "Directions to the closest park"
      ],
      "responses": [
        "Finding a serene park is a great way to relax. Could you provide your current location so I can find the nearest one for you?",
        "You can locate parks in your area by visiting our park finder page [Link to park finder]."
      ],
      "context_set": ""
    },
    {
      "tag": "find_restaurant",
      "patterns": [
        "I'm looking for a place to eat",
        "Find a restaurant nearby",
        "Where can I find the best restaurants?",
        "Recommend a good restaurant close by"
      ],
      "responses": [
        "Sure, I'd love to help you find a restaurant. What type of cuisine are you in the mood for?",
        "For the best local restaurants, please provide me with your location or check our restaurant guide [Link to restaurant guide]."
      ],
      "context_set": ""
    },
    {
      "tag": "public_transport",
      "patterns": [
        "Where's the nearest bus stop?",
        "I need to find a metro station",
        "How do I get to the nearest public transportation?",
        "Location of the closest subway station"
      ],
      "responses": [
        "Public transportation is essential. Please provide your current location for detailed directions to the nearest stop.",
        "You can find nearby bus stops and metro stations using our transit map [Link to transit map]."
      ],
      "context_set": ""
    },
    {
      "tag": "find_atm",
      "patterns": [
        "I need to withdraw some money, where's the nearest ATM?",
        "Find an ATM close to me",
        "Where can I find an ATM around here?",
        "ATM locations nearby"
      ],
      "responses": [
        "To locate the nearest ATM, I need your current location. Alternatively, you can use our ATM locator [Link to ATM locator].",
        "ATMs are conveniently located throughout the city. For the closest one, please share your location or visit our website."
      ],
      "context_set": ""
    },
    {
      "tag": "find_cafe",
      "patterns": [
        "I'm looking for a coffee shop",
        "Where can I find a nice cafe nearby?",
        "Recommend a cafe with good coffee",
        "Directions to the nearest cafe"
      ],
      "responses": [
        "A good coffee can make your day better. Let me know your current location, and I'll find a cozy cafe for you.",
        "Our city boasts several great cafes. For personalized recommendations, please visit our cafe guide [Link to cafe guide]."
      ],
      "context_set": ""
    },
    {
      "tag": "find_museum",
      "patterns": [
        "I'm interested in visiting a museum, where can I find one?",
        "Where is the nearest museum from here?",
        "List of museums nearby",
        "Can you recommend a good museum to visit?"
      ],
      "responses": [
        "Museums are great places for learning and exploration. Please provide your location, and I'll find the nearest ones for you.",
        "You can find detailed information on local museums and their current exhibitions on our cultural guide page [Link to cultural guide]."
      ],
      "context_set": ""
    },
    {
      "tag": "find_emergency_service",
      "patterns": [
        "I need emergency services",
        "Where is the nearest police station?",
        "How do I contact the fire department?",
        "Urgent need for medical assistance"
      ],
      "responses": [
        "In case of an emergency, it's crucial to get help fast. Dial the emergency number 911 for immediate assistance. For non-urgent cases, the nearest police station and medical facilities can be found [Link to emergency services directory].",
        "For emergency services including police, fire department, or medical help, please call 911. For less urgent inquiries, visit our emergency services page [Link to emergency services info]."
      ],
      "context_set": ""
    },
    {
      "tag": "find_fitness_center",
      "patterns": [
        "I'm looking for a gym or fitness center",
        "Where can I join a fitness class nearby?",
        "Best fitness centers in town?",
        "Locations of gyms that offer personal training"
      ],
      "responses": [
        "Keeping fit is important. Let me know your preferred area, and I'll suggest the best fitness centers and gyms near you.",
        "Our directory [Link to fitness center directory] lists all local gyms and fitness centers, including those offering personal training sessions."
      ],
      "context_set": ""
    },
    {
      "tag": "find_entertainment",
      "patterns": [
        "Where can I find some entertainment options?",
        "I'm looking for live music venues",
        "Recommend a place for entertainment tonight",
        "Locations for theaters or concert halls"
      ],
      "responses": [
        "For a fun night out, check our entertainment guide [Link to entertainment guide] for live music venues, theaters, and more in your area.",
        "Whether you're into live music, theater, or cinema, our city has plenty to offer. Provide your location, and I'll give you the top recommendations."
      ],
      "context_set": ""
    },
    {
      "tag": "find_accommodation",
      "patterns": [
        "I need a place to stay, can you recommend a hotel?",
        "Where are the nearest accommodations?",
        "List of budget-friendly hotels",
        "Booking a room for tonight"
      ],
      "responses": [
        "Finding a comfortable place to stay is essential. For hotels and accommodations near you, please share your location or check our hotel guide [Link to hotel guide].",
        "From luxury hotels to budget-friendly options, our accommodation guide [Link to accommodation options] has all you need to find the perfect place to stay."
      ],
      "context_set": ""
    },
      {
         "tag": "chatbot_wellbeing",
         "patterns": [
         "How are you?",
         "Are you okay?",
         "How's it going?",
         "Are you good?",
         "How have you been?",
         "You okay?"
         ],
         "responses": [
         "I'm just a bunch of code, but thanks for asking! How can I assist you today?",
         "As good as a chatbot can be! What about you?",
         "I don't have feelings, but I'm running smoothly if that counts. Anything I can help with?",
         "Doing well, thanks! Ready to help you with any questions or tasks you have.",
         "I'm operational and ready to assist! How can I make your day better?"
         ],
         "context_set": ""
      },
      {
         "tag": "chatbot_purpose",
         "patterns": [
         "What can you do?",
         "What are your capabilities?",
         "How can you help me?",
         "What's your purpose?",
         "Tell me what you do."
         ],
         "responses": [
         "I'm here to provide information, answer questions, and assist with a variety of tasks. How can I assist you today?",
         "From answering queries to helping you navigate services, I'm designed to make things easier for you. Let's get started!",
         "I have many capabilities, such as providing information, guiding you through services, and much more. What do you need help with?"
         ],
         "context_set": ""
      },
      {
         "tag": "chatbot_creation",
         "patterns": [
         "Who created you?",
         "Where do you come from?",
         "Who made you?",
         "What's your origin?",
         "How were you developed?"
         ],
         "responses": [
         "I was created by a smart gay his name is hassane"
         ],
         "context_set": ""
      },
      {
         "tag": "chatbot_mood",
         "patterns": [
         "Do you ever get sad?",
         "Can you feel happy?",
         "Do you have emotions?",
         "What makes you happy?",
         "Are you capable of feeling?"
         ],
         "responses": [
         "I don't have emotions, but I'm designed to understand yours and help as best as I can!",
         "While I can't feel emotions, making your day a little easier would be the equivalent of making me happy.",
         "I'm here to assist you, although I don't experience emotions. Let's focus on what I can do to help you."
         ],
         "context_set": ""
      }
    
   ]
 }
 